Family's Category can't be changed because the Family contains Shared Parameters which are not permitted in the new Category.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FamilyNoExternalParametersError { get; }
  Visual Basic
Public Shared ReadOnly Property FamilyNoExternalParametersError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FamilyNoExternalParametersError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace